perf/async.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 120
      arrivalRate: 500
      rampTo: 1000
    - name: Stop-1
      duration: 60
      arrivalRate: 1000
    - name: Linear-2
      duration: 120
      arrivalRate: 1000
      rampTo: 2000
    - name: Stop-2
      duration: 60
      arrivalRate: 2000
    - name: Linear-3
      duration: 120
      arrivalRate: 2000
      rampTo: 3000
    - name: "Nothing_End"
      pause: 15
    

scenarios:
  - name: Bbox-9091
    flow:
      - get:
          url: '/bbox-9091'