perf/ping.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
   - name: "1 request/s"
     duration: 20
     arrivalRate: 1      
   - name: Ramp to 500 rps
     duration: 240
     arrivalRate: 200
     rampTo: 520
   - name: "1 request/s"
     duration: 30
     arrivalRate: 1
    

scenarios:
  - name: Ping (/)
    flow:
      - get:
          url: '/ping'